import React from 'react';
import ReactDOM from 'react-dom/client';
import './index.css';
import App from "./App";


const root = ReactDOM.createRoot(document.getElementById('root'));
root.render(
    <App />
);

// 1. Создайте компонент счетчика с кнопками для увеличения и уменьшения значения.
// Используйте useState для управления значением счетчика.

// Создайте компонент с текстом и кнопкой "Показать/Скрыть".
// При нажатии на кнопку текст должен показываться или скрываться с использованием условного рендеринга.

// Создайте компонент с текстом и кнопками для изменения цвета текста (например, на красный, синий, зеленый).
// Используйте useState для хранения текущего цвета и условный рендеринг для изменения стиля.

// Создайте компонент с кнопкой, которая меняет цвет фона страницы при нажатии.
// Используйте useState для хранения состояния текущего цвета фона.

// Создайте простой список задач с возможностью добавить одну новую задачу через поле ввода.
// Используйте useState для управления списком задач.

// Создайте компонент с кнопкой, которая меняет свое состояние на "Включено" или "Выключено" при нажатии.
// Используйте условный рендеринг для отображения текущего состояния.

// Создайте кнопку, которая считает, сколько раз на нее нажали, и отображает это число.
// Используйте useState для хранения и обновления количества кликов.

// Создайте форму с текстовым полем, где введенный текст отображается ниже поля ввода в режиме реального времени.
// Используйте useState для хранения значения поля ввода.

// Создайте компонент, который показывает сообщение "Добро пожаловать" при нажатии кнопки "Показать".
// Используйте условный рендеринг для отображения сообщения.

// Создайте компонент с текстом и кнопками "Увеличить" и "Уменьшить" для изменения размера шрифта текста.
// Используйте useState для управления размером шрифта.