// 1. Найдите сумму всех элементов в массиве чисел.

// const nums = [32, 10, 1, 0, 43, 17, 25, 3]

// let sum = 0

// for(let i = 0; i < nums.length; i++) {
//     // sum += nums[i]
//     sum = sum + nums[i]
// }

// console.log(sum);

// 2. Найдите наибольший элемент в массиве.

const arr = [10,10,32,4,5]

let max = 0

for(let i = 0; i < arr.length; i++) {
    if(arr[i] > max){
        max = arr[i]
    }   
}

console.log(max);


// 3. Найдите наименьший элемент в массиве.
// 4. Проверьте, содержит ли массив заданный элемент.
// 5. Удалите все дубликаты из массива.
// 6. Объедините два массива без дубликатов.
// 7. Инвертируйте порядок элементов в массиве.
// 8. Отсортируйте массив чисел по возрастанию.
// 9. Найдите индекс заданного элемента в массиве.
// 10. Разбейте массив на части заданной длины.
// 11. Замените все отрицательные элементы в массиве на ноль.
// 12. Найдите среднее значение элементов в массиве.
// 13. Создайте новый массив, содержащий только четные числа из исходного массива.
// 14. Перемешайте элементы массива.
// 15. Найдите наиболее часто встречающийся элемент в массиве.
